//新闻数据
const news = [
  {id: '305674',
  title: '中国海洋大学迎来2026级本科生',
  poster: 'https://news.ouc.edu.cn/_upload/article/images/83/47/75d4ca9c44458941226f24393cd8/ccfd7413-d262-4f43-8b62-c6eaee2ffe5b.jpg',
  content: `8月30日，中国海洋大学2026级本科生从五湖四海奔赴海大园，正式开启探索深蓝的逐梦之旅。学校党委书记李明，校长张峻峰，副校长林旭升、王雪鹏现场检查指导各项迎新工作部署落实情况，看望来校报到的本科新生及家长，慰问参与迎新工作的师生员工。
  李明首先来到崂山校区南门党员先锋服务岗，亲切慰问值守一线的师生党员，详细询问新生报到流程与实时进展。在法学院和国际事务与公共管理学院，李明深入了解新生注册各环节情况，与在场志愿者及报到新生亲切交流。在中海苑学生社区，李明为新生代表发放“爱心大礼包”及“海之子·启航”助学金，走进学生宿舍看望新生，勉励同学们珍惜韶华、勤勉笃行，胸怀蓝色梦想、堪当时代重任，奋力书写无愧于时代的青春华章。
  张峻峰先后来到海洋与大气学院、“海之子”迎新摆渡车站点、迎新初到接待点、教育超市及北海苑学生宿舍，实地检查学生报到注册、院系迎新服务及后勤综合保障等各项工作落实情况。张峻峰慰问坚守一线的迎新工作人员，与新生亲切交谈，勉励同学们尽快转变学习方式、融入校园环境、适应大学节奏，在勤学笃行中砥砺成长、增长才干，努力成为堪当民族复兴重任的时代新人。
  为切实做好2026级本科生迎新工作，学校精心部署、周密安排，全力营造温馨、便捷、高效的入学报到环境。在各校门设立“迎新党员先锋服务岗”，为新生及家长提供咨询指引、行李暂存、应急援助等贴心服务；开通“海之子”迎新校内摆渡车，免费接送新生及家长在校内通行，并随车配备校史校情讲解员，全天候开展校情宣讲与答疑咨询。在学生社区设置学院初到接待点与资助政策咨询点，组织志愿者协助新生高效办理入住手续，面对面解答资助相关政策。同时，全面开通新生入学“绿色通道”，坚持个性化资助与隐形资助相结合，精准对接困难学生实际需求，切实保障每一名学子无忧入学、从容开启大学生活。`,
  add_date: '2026-08-31'},
  {id: '264698',
  title: '山东省人民政府副省长、党组成员闫剑波来校调研',
  poster: 'https://news.ouc.edu.cn/_upload/article/images/30/6b/13f1209e40608a955d175ac5dd02/f24f725e-9573-4bc8-a65b-bb7717917c1d.jpg',
  content: `8月27日，山东省人民政府副省长、党组成员闫剑波来校调研。学校党委书记李明陪同调研。闫剑波一行参观了学校校史馆、海洋科技成果展和海洋工程技术与装备展，听取学校百年发展历程和成就介绍，考察学校海洋科技创新和服务经济社会发展情况。
他指出，中国海洋大学历史悠久、特色显著，是我国海洋科教的旗帜、山东教育的名片，肩负着海洋强国建设的特殊重要使命。希望学校认真贯彻落实习近平总书记视察山东重要讲话和重要指示精神，大力推动教育、科技、人才一体发展，强化产教融合、科教融汇、校地合作、对外开放，加强拔尖创新人才培养和高层次人才引育，推动海洋科技高水平自立自强，加快把科研势能转化为产业发展动能，为山东一体推进教育强省、科技强省、人才强省建设，打造现代海洋经济发展高地贡献更大力量。
李明对山东省委省政府的坚强领导和鼎力支持表示感谢。他表示，学校将全面贯彻习近平总书记重要讲话和重要回信精神，落实省委省政府部署要求，扎根齐鲁大地、赓续百年荣光、深耕海洋科教、扛牢时代责任，锚定国家战略和区域经济社会高质量发展需求，大力实施新时代立德树人工程，高水平推进“双一流”建设，聚力突破海洋领域原创性、引领性关键技术，推进科技创新与产业创新深度融合，加强成果转化，拓展国际交流合作，切实把学科综合优势、海洋深厚积淀转化为服务高质量发展的实际成效，不断开创一流大学建设新局面，为强国和强省建设作出新的更大贡献。`,
  add_date: '2026-08-28'},
  {id: '304083',
  title: '中国船舶集团有限公司董事长、党组书记徐鹏来校调研',
  poster: 'https://news.ouc.edu.cn/_upload/article/images/e0/1a/0f1277ee4eb8afe3cc2f9fb37777/dba374ab-3182-4713-bb7b-bf2621b9db4f.jpg',
  content: `8月27日，中国船舶集团有限公司董事长、党组书记徐鹏来校调研。学校党委书记李明陪同调研并座谈。
李明对徐鹏一行表示欢迎。他表示，中国船舶集团是全球最大的造船集团，是我国船舶工业发展的主力军。学校正全面贯彻落实习近平总书记给学校全体师生的重要回信精神，大力推进科技创新与产业创新深度融合。期待双方加强全方位战略合作，在深海、极地装备、智能船舶等领域开展原创性引领性协同创新，大力推进人才共育、平台共建、项目共担、资源共享、互利共赢，共同为海洋经济高质量发展、为强国建设作出更大贡献。
徐鹏介绍了中国船舶集团的发展情况。他表示，双方在深海装备、极地装备、海上风电等方面合作空间巨大。中船集团将与中国海洋大学携手并进，系统策划重大项目，加速科技成果产业化，共同为海洋强国建设贡献力量。`,
  add_date: '2026-08-28'},
  {id: '305670',
  title: '中国海洋大学2026级研究生开学典礼举行',
  poster: 'https://news.ouc.edu.cn/_upload/article/images/dc/f8/06c1b91d4f12876219c149ce1f4f/7f012f17-2a9d-4ff3-b431-4b114cb8046c.jpg',
  content: `海纳新知，逐梦启航。8月24日，中国海洋大学2026级研究生开学典礼在崂山校区综合体育馆举行。党委书记李明，党委副书记、校长张峻峰，党委副书记范其伟，党委常委、副校长林旭升，党委副书记、纪委书记俞黎阳，党委副书记蒋秋飚，党委常委、副校长李岩出席。党委常委、副校长王雪鹏主持。1134名博士研究生、5092名硕士研究生胸怀蓝色梦想，跨越五湖四海，齐聚海大园，开启新征程。
李明为研究生卓越奖学金获得者颁发荣誉证书。范其伟宣读了《关于颁发2026年中国海洋大学研究生卓越奖学金的决定》。2023级物理海洋学专业博士研究生谢春虎，2022级水生生物学专业博士研究生赖文聪，2022级食品科学与工程专业博士研究生陈广宁，2022级港口、海岸及近海工程专业博士研究生曾昕萌受到表彰。
张峻峰代表学校对新同学表示欢迎。他指出，研究生阶段是职业发展的起点，要更加明确学习目标、奋斗志向，清楚为谁学习、为谁科研；要更加深耕专业方向、注重科研训练，锤炼科学素养、提升逻辑思维；要更加自主自觉，从“学会”转向“学问”和“研究”，敢于提出好问题、善于解决真问题，努力在前人止步的地方创造新知识。
张峻峰指出，身处世界之变、时代之变、历史之变加速演进的当下，人工智能正在深刻重塑人类的学习方式、认知方式和科研范式。对于如何在AI时代做好研究生阶段的学习与科研，他寄语学生，要正确认识人工与智能的关系，以人机协同契合科研时代性，在人机良性互动中探索符合新时代研究规律和自身特点的最佳路径；要正确认识学术与技术的关系，以扎实学识守牢科研主体性，搭建属于自己的系统化、精细化知识架构；要正确认识继承与开创的关系，以原创思维提升科研创新性，持续锤炼创新思维、精进创新能力；要正确认识效率与质量的关系，以求实精神涵养科研严谨性，坚持长期主义，恪守科研规范，严守学术诚信。他希望同学们立科研报国大志向，把个人学术追求融入强国建设、民族复兴的时代大局，努力成长为胸怀蓝色梦想、堪当时代重任的栋梁之才。`,
  add_date: '2026-08-24'}
];

//获取新闻列表
function getNewsList() {
  let list = [];
  for (var i = 0; i < news.length; i++) {
    let obj = {};
    obj.id = news[i].id;
    obj.poster = news[i].poster;
    obj.add_date = news[i].add_date;
    obj.title = news[i].title;
    list.push(obj);
  }
  return list; //返回新闻列表
}

//获取新闻内容
function getNewsDetail(newsID) {
  let msg = {
    code: '404', //没有对应的新闻
    news: {}
  };
  for (var i = 0; i < news.length; i++) {
    if (newsID == news[i].id) { //匹配新闻id编号
      msg.code = '200'; //成功
      msg.news = news[i]; //更新当前新闻内容
      break;
    }
  }
  return msg; //返回查找结果
}

// 对外暴露接口
module.exports = {
  getNewsList: getNewsList,
  getNewsDetail: getNewsDetail
}